/*
 * Реализуйте алгоритм Дейкстры для поиска кратчайших путей между города-
 * ми, связанными сетью автомобильных дорог. (Описание этого алгоритма мож-
 * но найти в популярной литературе по алгоритмам или в соответствующей ста-
 * тье Википедии.) Воспользуйтесь вспомогательным классом Neighbor для хране-
 * ния названия соседнего города и расстояния до него. Представьте полученный
 *
 * граф в виде преобразования названий городов в множества соседних городов.
 * Воспользуйтесь в данном алгоритме классом PriorityQueue<Neighbor>.
 */

import java.util.PriorityQueue;

public class pp10 {
    public static void main(String[] args) {
//        PriorityQueue<Neighbor>
    }
}
