/*
 * Реализуйте статический метод o f () из интерфейса In t S e q u e n c e , возвращаю-
 * щий последовательность из передаваемых ему аргументов. Например, в ре-
 * зультате вызова метода In t S e q u e n c e . o f (3, 1, 4, 1, 5, 9) возвращается после-
 * довательность из шести значений. В качестве дополнительного задания орга-
 * низуйте возврат экземпляра анонимного внутреннего класса.
 */

public class Program4 {
    public static void main(String[] args) {
        System.out.println(IntSequance.of(3, 1, 4, 1, 5, 9));
    }
}
