/* Напишите прогрумму, выводящую наименьшее и наибольшее положитель-
*  ные значения типа double. Подсказка: воспользуйтесь методом Math.nextUp()
*  из прикладного программного интерфейса java API.
*/

public class Program04 {
    public static void main(String[] args) {
        System.out.println(Math.nextUp(0.0));
        System.out.println(Double.MAX_VALUE);
    }
}
